# С клавиатуры вводится строка, 
# содержащая произвольное количество слов через запятую и пробел. 
# Слова могут повторяться. Нужно вывести на экран все слова в алфавитном порядке по одному разу, 
# также через пробел и запятую.

# Формат ввода
# джек, воробей, капитан, джек, воробей

# Формат вывода
# воробей, джек, капитан

# Примечания
# Обратите внимание, что в примере у первого слова "воробей" стоит запятая, а у второго - нет. 
# В решении такие случае следует учесть. 
# Кроме того, слова могут быть написаны в разном регистре. 
# Вывести их нужно в нижнем регистре. 
# Одинаковые слова, написанные в разных регистрах, считаем одинаковыми.

txt = input().replace(",", "").lower().split()

myset = set()

flag = True

for i in txt:
    myset.add(i)
    
print(", ".join(sorted(myset)))